app/Models/CargoModel.php

SELECT `coconut_cargo`.*, `coconut_ship`.`name`, `coconut_user`.`id`, `coconut_user`.`name` as `username`
FROM `coconut_cargo`
LEFT JOIN `coconut_ship` ON `coconut_ship`.`id` = `coconut_cargo`.`ship_id`
LEFT JOIN `coconut_user` ON `coconut_user`.`id` = `coconut_cargo`.`user_id`
WHERE `coconut_cargo`.`is_completed` = 0
AND DATE(coconut_cargo.created_at) = '2024-12-06'
AND `coconut_user`.`id` = '3'
---
    public function getUnfinishedCargo($id, $date)
    {
        $s = $this->select('coconut_cargo.*, coconut_ship.name, coconut_user.id as user_id, coconut_user.name as username')
                ->join('coconut_ship', 'coconut_ship.id = coconut_cargo.ship_id', 'LEFT')
                ->join('coconut_user', 'coconut_user.id = coconut_cargo.user_id', 'LEFT')
                ->where('coconut_cargo.is_completed', 0)
                ->where('DATE(coconut_cargo.created_at)', $date)
                ->where('coconut_user.id', $id)->findAll();

SELECT `coconut_cargo`.*, `coconut_ship`.`name`, `coconut_user`.`id` as `user_id`, `coconut_user`.`name` as `username`
FROM `coconut_cargo`
LEFT JOIN `coconut_ship` ON `coconut_ship`.`id` = `coconut_cargo`.`ship_id`
LEFT JOIN `coconut_user` ON `coconut_user`.`id` = `coconut_cargo`.`user_id`
WHERE DATE(coconut_cargo.created_at) = '2024-12-06'
AND `coconut_cargo`.`is_completed` = 0
---
    public function getAllUnfinishedCargo($date)
    {
        $s = $this->select('coconut_cargo.*, coconut_ship.name, coconut_user.id as user_id, coconut_user.name as username')
                ->join('coconut_ship', 'coconut_ship.id = coconut_cargo.ship_id', 'LEFT')
                ->join('coconut_user', 'coconut_user.id = coconut_cargo.user_id', 'LEFT')
                ->where('DATE(coconut_cargo.created_at)', $date)
                ->where('coconut_cargo.is_completed', 0)
                ->findAll();